## Plan Result (sbox_shutter_webapp - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 5 to add, 0 to change, 5 to destroy.</code></pre>

* Create
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;labs-goldenpath-jamie&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;labs-goldenpath-jamie&#34;]
  * module.static_webapp.azurerm_static_site.swebapp[&#34;labs-goldenpath-jamie&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;labs-goldenpath-jamie&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;labs-goldenpath-jamie&#34;]
* Delete
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;lab-jamiemcconnell-goldenpath&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;lab-jamiemcconnell-goldenpath&#34;]
  * module.static_webapp.azurerm_static_site.swebapp[&#34;lab-jamiemcconnell-goldenpath&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;lab-jamiemcconnell-goldenpath&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;lab-jamiemcconnell-goldenpath&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.static_webapp.azurerm_dns_cname_record.cname_record["lab-jamiemcconnell-goldenpath"] will be destroyed
  # (because key ["lab-jamiemcconnell-goldenpath"] is not in for_each map)
  - resource "azurerm_dns_cname_record" "cname_record" {
      - fqdn                = "lab-jamiemcconnell-goldenpath-shutter.sandbox.platform.hmcts.net." -> null
      - id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/sandbox.platform.hmcts.net/CNAME/lab-jamiemcconnell-goldenpath-shutter" -> null
      - name                = "lab-jamiemcconnell-goldenpath-shutter" -> null
      - record              = "proud-ocean-080346a03.4.azurestaticapps.net" -> null
      - resource_group_name = "reformMgmtRG" -> null
      - tags                = {} -> null
      - ttl                 = 300 -> null
      - zone_name           = "sandbox.platform.hmcts.net" -> null
        # (1 unchanged attribute hidden)
    }

  # module.static_webapp.azurerm_dns_cname_record.cname_record["labs-goldenpath-jamie"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "labs-goldenpath-jamie-shutter"
      + record              = (known after apply)
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.static_webapp.azurerm_dns_txt_record.zone_validate["lab-jamiemcconnell-goldenpath"] will be destroyed
  # (because key ["lab-jamiemcconnell-goldenpath"] is not in for_each map)
  - resource "azurerm_dns_txt_record" "zone_validate" {
      - fqdn                = "_dnsauth.lab-jamiemcconnell-goldenpath.sandbox.platform.hmcts.net." -> null
      - id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/sandbox.platform.hmcts.net/TXT/_dnsauth.lab-jamiemcconnell-goldenpath" -> null
      - name                = "_dnsauth.lab-jamiemcconnell-goldenpath" -> null
      - resource_group_name = "reformMgmtRG" -> null
      - tags                = {} -> null
      - ttl                 = 3600 -> null
      - zone_name           = "sandbox.platform.hmcts.net" -> null

      - record {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.static_webapp.azurerm_dns_txt_record.zone_validate["labs-goldenpath-jamie"] will be created
  + resource "azurerm_dns_txt_record" "zone_validate" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.labs-goldenpath-jamie"
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 3600
      + zone_name           = "sandbox.platform.hmcts.net"

      + record {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.static_webapp.azurerm_static_site.swebapp["lab-jamiemcconnell-goldenpath"] will be destroyed
  # (because key ["lab-jamiemcconnell-goldenpath"] is not in for_each map)
  - resource "azurerm_static_site" "swebapp" {
      - api_key             = (sensitive value) -> null
      - default_host_name   = "proud-ocean-080346a03.4.azurestaticapps.net" -> null
      - id                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-platform-shutter-webapp-sbox-rg/providers/Microsoft.Web/staticSites/lab-jamiemcconnell-goldenpath" -> null
      - location            = "westeurope" -> null
      - name                = "lab-jamiemcconnell-goldenpath" -> null
      - resource_group_name = "cft-platform-shutter-webapp-sbox-rg" -> null
      - sku_size            = "Free" -> null
      - sku_tier            = "Free" -> null
      - tags                = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/azure-platform-terraform"
          - "businessArea" = "CFT"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
          - "startupMode"  = "always"
        } -> null
    }

  # module.static_webapp.azurerm_static_site.swebapp["labs-goldenpath-jamie"] will be created
  + resource "azurerm_static_site" "swebapp" {
      + api_key             = (sensitive value)
      + default_host_name   = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "labs-goldenpath-jamie"
      + resource_group_name = "cft-platform-shutter-webapp-sbox-rg"
      + sku_size            = "Free"
      + sku_tier            = "Free"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
          + "startupMode"  = "always"
        }
    }

  # module.static_webapp.azurerm_static_site_custom_domain.custom_domain["lab-jamiemcconnell-goldenpath"] will be destroyed
  # (because key ["lab-jamiemcconnell-goldenpath"] is not in for_each map)
  - resource "azurerm_static_site_custom_domain" "custom_domain" {
      - domain_name      = "lab-jamiemcconnell-goldenpath.sandbox.platform.hmcts.net" -> null
      - id               = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-platform-shutter-webapp-sbox-rg/providers/Microsoft.Web/staticSites/lab-jamiemcconnell-goldenpath/customDomains/lab-jamiemcconnell-goldenpath.sandbox.platform.hmcts.net" -> null
      - static_site_id   = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-platform-shutter-webapp-sbox-rg/providers/Microsoft.Web/staticSites/lab-jamiemcconnell-goldenpath" -> null
      - validation_type  = "dns-txt-token" -> null
        # (1 unchanged attribute hidden)
    }

  # module.static_webapp.azurerm_static_site_custom_domain.custom_domain["labs-goldenpath-jamie"] will be created
  + resource "azurerm_static_site_custom_domain" "custom_domain" {
      + domain_name      = "labs-goldenpath-jamie.sandbox.platform.hmcts.net"
      + id               = (known after apply)
      + static_site_id   = (known after apply)
      + validation_token = (sensitive value)
      + validation_type  = "dns-txt-token"
    }

  # module.static_webapp.github_actions_secret.secret["lab-jamiemcconnell-goldenpath"] will be destroyed
  # (because key ["lab-jamiemcconnell-goldenpath"] is not in for_each map)
  - resource "github_actions_secret" "secret" {
      - created_at      = "2024-12-17 14:21:13 +0000 UTC" -> null
      - id              = "azure-shutter-pages:lab_jamiemcconnell_goldenpath_sbox" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "azure-shutter-pages" -> null
      - secret_name     = "lab_jamiemcconnell_goldenpath_sbox" -> null
      - updated_at      = "2024-12-17 14:21:13 +0000 UTC" -> null
        # (1 unchanged attribute hidden)
    }

  # module.static_webapp.github_actions_secret.secret["labs-goldenpath-jamie"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "labs_goldenpath_jamie_sbox"
      + updated_at      = (known after apply)
    }

Plan: 5 to add, 0 to change, 5 to destroy.

Changes to Outputs:
  ~ debug_shutter = [
        # (3 unchanged elements hidden)
        {
            backend_domain   = [
                "firewall-sbox-int-palo-labs-goldenpath-lukasz.uksouth.cloudapp.azure.com",
            ]
            certificate_name = "wildcard-sandbox-platform-hmcts-net"
            custom_domain    = "labs-goldenpath-lukasz.sandbox.platform.hmcts.net"
            disabled_rules   = {}
            dns_zone_name    = "sandbox.platform.hmcts.net"
            name             = "labs-goldenpath-lukasz"
            product          = "labs-goldenpath-lukasz"
        },
      ~ {
          ~ backend_domain   = [
              ~ "firewall-sbox-int-palo-lab-jamiemcconnell-goldenpath.uksouth.cloudapp.azure.com" -> "firewall-sbox-int-palo-labs-goldenpath-jamie.uksouth.cloudapp.azure.com",
            ]
          ~ custom_domain    = "lab-jamiemcconnell-goldenpath.sandbox.platform.hmcts.net" -> "labs-goldenpath-jamie.sandbox.platform.hmcts.net"
          ~ name             = "lab-jamiemcconnell-goldenpath" -> "labs-goldenpath-jamie"
          ~ product          = "lab-jamiemcconnell-goldenpath" -> "labs-goldenpath-jamie"
            # (3 unchanged attributes hidden)
        },
        {
            backend_domain   = [
                "firewall-sbox-int-palo-labs-goldenpath-dawid.uksouth.cloudapp.azure.com",
            ]
            certificate_name = "wildcard-sandbox-platform-hmcts-net"
            custom_domain    = "labs-goldenpath-dawid.sandbox.platform.hmcts.net"
            disabled_rules   = {}
            dns_zone_name    = "sandbox.platform.hmcts.net"
            name             = "labs-goldenpath-dawid"
            product          = "labs-goldenpath-dawid"
        },
    ]
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":2345,"Program":"tfcmt","SHA1":"","Target":"sbox_shutter_webapp - TerraformPlanApply","Vars":{}} -->